cases/chpt5-tubeBatch-25/constant/AMsourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceVel (0 0 0);
sourcePos0 (0.002 0 0.0011375);
sourcePos1 (0 0 0);
sourcePos2 (0 0 0);
sourceOmega 0.00075;
sourcePenn 	0.00025;
sourceStartTime 0;
sourcePauseTime 2;
sourceEndTime 1e3;
sourcePower 30;
sourceC_C 60;//150 is just under
sourceFieldCut 0.01;

sourcePause true;
sourceTwo false;
sourceThree false;
oneMeter 1;