cases/chpt5-tubeBatch-25/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }
    btm
    {
        type            calculated;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
    side1Andside2Andside3
    {
        type            calculated;
        value           $internalField;
    }
    top_side1Andside2Andside3
    {
        $btm;
    }
    btm_side1Andside2Andside3
    {
        $btm;
    }
}

// ************************************************************************* //
